docs/tensorflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-01 Sat 17:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tensorflow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tensorflow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org81096aa">1. What is Tensorflow</a>
<ul>
<li><a href="#org567b406">1.1. Glossary</a></li>
</ul>
</li>
<li><a href="#orgeb3da25">2. TF Slim</a>
<ul>
<li><a href="#org65474cc">2.1. <code>arg_scope</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org81096aa" class="outline-2">
<h2 id="org81096aa"><span class="section-number-2">1</span> What is Tensorflow</h2>
<div class="outline-text-2" id="text-1">
<p>
TensorFlow is open-source software library for numerical computation.
A graph of computations is defined, and TensorFlow builds an optimized
graph from that.
</p>

<p>
TensorFlow breaks up the graph into several chunks and run them in
parallel across multiple CPUs or GPUs where possible, and also
supports distributed computing.
</p>
</div>
<div id="outline-container-org567b406" class="outline-3">
<h3 id="org567b406"><span class="section-number-3">1.1</span> Glossary</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>tensor</dt><dd>A tf.Tensor object represents a partially defined
computation that will eventually produce a value.
TensorFlow programs work by first building a graph of
tf.Tensor objects, detailing how each tensor is computed
based on the other available tensors and then by running
parts of this graph to achieve the desired results.</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgeb3da25" class="outline-2">
<h2 id="orgeb3da25"><span class="section-number-2">2</span> TF Slim</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org65474cc" class="outline-3">
<h3 id="org65474cc"><span class="section-number-3">2.1</span> <code>arg_scope</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://github.com/tensorflow/tensorflow/blob/master/tensorflow/contrib/framework/python/ops/arg_scope.py">https://github.com/tensorflow/tensorflow/blob/master/tensorflow/contrib/framework/python/ops/arg_scope.py</a>
</p>

<p>
Example of how to use tf.contrib.framework.arg<sub>scope</sub>:
</p>

<div class="org-src-container">
<pre class="src src-python">from third_party.tensorflow.contrib.layers.python import layers

arg_scope = tf.contrib.framework.arg_scope

with arg_scope([layers.conv2d], padding='SAME',
               initializer=layers.variance_scaling_initializer(),
               regularizer=layers.l2_regularizer(0.05)):
  net = layers.conv2d(inputs, 64, [11, 11], 4, padding='VALID', scope='conv1')
  net = layers.conv2d(net, 256, [5, 5], scope='conv2')
</pre>
</div>

<p>
The first call to conv2d will behave as follows:
</p>

<div class="org-src-container">
<pre class="src src-python">layers.conv2d(inputs, 64, [11, 11], 4, padding='VALID',
              initializer=layers.variance_scaling_initializer(),
              regularizer=layers.l2_regularizer(0.05), scope='conv1')
</pre>
</div>
<p>
The second call to conv2d will also use the arg<sub>scope</sub>'s default for
padding:
</p>

<div class="org-src-container">
<pre class="src src-python">layers.conv2d(inputs, 256, [5, 5], padding='SAME',
              initializer=layers.variance_scaling_initializer(),
              regularizer=layers.l2_regularizer(0.05), scope='conv2')
</pre>
</div>

<p>
Example of how to reuse an arg<sub>scope</sub>:
</p>

<div class="org-src-container">
<pre class="src src-python">with arg_scope([layers.conv2d], padding='SAME',
               initializer=layers.variance_scaling_initializer(),
               regularizer=layers.l2_regularizer(0.05)) as sc:
    net = layers.conv2d(net, 256, [5, 5], scope='conv1')
    # ...

with arg_scope(sc):
    net = layers.conv2d(net, 256, [5, 5], scope='conv2')
</pre>
</div>

<p>
Example of how to use tf.contrib.framework.add<sub>arg</sub><sub>scope</sub> to enable your
function to be called within an arg<sub>scope</sub> later:
</p>

<div class="org-src-container">
<pre class="src src-python">@tf.contrib.framework.add_arg_scope
def conv2d(*args, **kwargs)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-09-01 Sat 17:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
